# Решение задачи
**Написать программу, которая из имеющегося массива строк формирует массив из строк, длина которых меньше либо равна 3 символа.**

## Создание первоначального массива
**Для решения задачи необходимо задать первоначальный массив.**

**Создаём массив для пяти элементов, сами элементы вводим с клавиатуры.**

*string[] array1 = new string[5];*

*Console.WriteLine("Введите первую строку");*

*array1[0] = Convert.ToString(Console.ReadLine());*

*Console.WriteLine("Введите вторую строку");*

*array1[1] = Convert.ToString(Console.ReadLine());*

*Console.WriteLine("Введите третью строку");*

*array1[2] = Convert.ToString(Console.ReadLine());*

*Console.WriteLine("Введите четвёртую строку");*

*array1[3] = Convert.ToString(Console.ReadLine());*

*Console.WriteLine("Введите пятую строку");*

*array1[4] = Convert.ToString(Console.ReadLine());*

**Каждая строка, введённая с клавиатуры, соответствует индексу массива от 0 до 4.**

**Выводим получившийся массив в консоль.**

*System.Console.Write(string.Join(" ", array1));*

## Создание второго массива
**Создаём новый массив, в который помещаем те элементы из первоначального массива, которые меньше или равны трём.**

**Если все элементы имеют больше трёх символов, выводим в консоль фразу: "Длина каждого элемента первоначального массива составляет больше трёх символов".**

**Выводим получившийся массив в консоль.**

**Обрамляем создание и выведение второго массива в метод (функцию).**

*string[] array2 = FillArrayAndPrint(array1);*

*string[] FillArrayAndPrint(string[] Array1)*

*{ string[] Array = new string[5];*

  *int n = 0;*
  
  *for (int i = 0; i < Array1.Length; i++)*
  
  *{*
  
    if (Array1[i].Length <= 3)
    
    {
    
       Array[n] = Array1[i];
        
       n = n + 1;
        
    }
    
   *}*
   
 *if (n == 0)*
   
  *{*
    
      Console.WriteLine("Длина каждого элемента первоначального массива составляет больше трёх символов");
        
  *}*
    
*else {System.Console.Write(string.Join(" ", Array));}*
  
*return Array;}*
  
## Связывание локального репозитория с удалённым на GitHub
  
### Создание коммита
  
#### Добавление файлов к коммиту
**Для добавления файлов к коммиту используется команда *git add*. Для того, чтобы добавить файл к новому коммиту необходимо в терминале с открытой папкой-репозиторием написать *git add <имя файла>*.**

#### Создание коммитов
**Для создание коммитов используется команда *git commit*. Для этого в терминале с папкой-репозиторием необходимо написать команду *git commit -m "<сообщение к коммиту>"*. Сообщение к коммиту писать ***ОБЯЗАТЕЛЬНО***.** 

### Отправка локального репозитория на GitHub
**Для отправки локального репозитория на GitHub используется команда *git remote add origin*. Для этого в терминале с открытой папкой-репозиторием необходимо написать *git remote add origin <ссылка_на_удалённый_репозиторий>*. Далее написать *git branch -M master*, чтобы обозначить ветку master основной. Далее написать *git push -u origin main*, чтобы направить в удалённый репозиторий на GitHub всё, что мы сделали в локальном репозитории.**
